"""
5.定义数据结构，存储以下信息：
    -- 多个人城市的多个景区和美食
    "北京"
        "景区":"天安门","天坛","故宫"
        "美食":"驴打滚","豆汁"
    "四川"
        "景区":"九寨沟","宽窄巷子"
        "美食":"火锅","串串香"
  打印北京的所有美食(一行一个)
  打印所有城市(一行一个)
  (扩展)打印所有城市的所有景区(一行一个)
"""
dict_info02 = {
    "北京": {
        "景区": ["天安门", "天坛", "故宫"],
        "美食": ["驴打滚", "豆汁"]
    },
    "四川": {
        "景区": ["九寨沟", "宽窄巷子"],
        "美食": ["火锅", "串串香"]
    }
}
for item in dict_info02["北京"]["美食"]:
    print(item)

for key in dict_info02:
    print(key)

for key in dict_info02:
    for item in dict_info02[key]["景区"]:
        print(item)
