# set01 = {"悟空", "唐僧"}  # 只有键，没有值，没有冒号的是集合
# set02 = {}
#
# list01 = ["悟空", "唐僧", "悟空"]
# set02 = set(list01)  # {"悟空", "唐僧"}  有去重功能
#
# # 2.
# # 增加
# set01.add("小白龙")
# print(set01)
#
# if "悟空2" in set01:
#     set01.remove("悟空2")
# set01.remove("悟空2")
#
# set01.discard("悟空")   # 特点是，就算没有“悟空”也不会报错
# print(set01)
""
"""
    集合set
        价值2：数学运算
        
"""
s01 = {1, 2, 3}
s02 = {2, 3, 4}
# 交集：左右都有的元素
print(s01 & s02) #{2, 3}

# 并集：返回左右不重复的元素
print(s01 | s02) #{1, 2, 3, 4}

# 补集（对称）
print(s01 ^ s02) #{1, 4}

# s01 有 s02 没有的
print(s01 - s02)  # {1}
print(s02 - s01)  # {4}

# 子集
s03 = { 2, 3}
print(s03 < s01)  # True

# 超集
print(s01 > s03) # True


















