"""
    函数参数：
        形式参数：
            # 1.默认参数：实参可以不传递
            # （必须从右向左一次存在）
            #   位置：必须传参
                        星号元组：位置实参数量无限
                命名关键字：要求实参必须是字典
                        双星字典：关键字实参数量无限
"""

# 1.默认参数：实参可以不传递
# （必须从右向左一次存在）
# def fun01(p1="", p2=0, p3=0):
#     print(p1)
#     print(p2)
#     print(p3)
#
#
# # 关键字实参  + 默认参数：实参可以随意传递
# fun01(p2=100)


# fun01()
# # fun01("悟空", 10, 5.6)
# fun01("悟空",5.6)
# dict01 = {"p1":2, "p3":3}
# fun01(**dict01)

# list01 = [1, 2, 3]
# fun01(*list01)

# 2,位置形参：实参必须传递
# def fun01(p1, p2, p3):
#     print(p1)
#     print(p2)
#     print(p3)


# 3.星号元组形参：使用星号将实参合并为一个元祖
# 作用：位置实参数量无限
# 备注：只能有一个
# def fun03(*args):  # 合
#     print(args)
#
# fun03(4, 55,[1,2], 4)
# fun03(a=1, b=3,c=3)  # 关键字实参不能用


#
# def(p2)

# 4.命名关键字形参：星号元组形参后面的参数
# 要求实参必须是关键字实参
# def fun04(*args, a, b=1):
#     print(args)
#     print(a)
#     print(b)
#
# fun04(33,34,55,a=33)


# def fun05(*, a, b=1):
#     print(a)
#     print(b)
# fun05(1)
#
#
# # # 4.命名关键字形参：星号元组形参后面的参数
# # # 要求实参必须是关键字实参
# def fun05(a, *, b=1, c=""):
#     print(a)
#     print(b)
#     print(c)


# 5.双星号字典形参：关键字实参数量无限
def fun06(**kwargs):
    print(kwargs)

fun06(a=1, b=2, c=3)












