"""
    函数参数：
        实际参数：
            位置实际参数
                序列
            关键字实际参数
                字典
        形式参数：
"""


def fun01(p1, p2, p3):
    print(p1)
    print(p2)
    print(p3)


# fun01(1, 2, 3)
# fun01(1, 2)
# fun01(1, 2, 3, 4)   # 1.位置实参 positional arguments
list01 = [2, 3, 5]  # 2.序列实参：使用*号拆分序列中的元素，再根据位置与形参对应
# fun01(*list01)  # 3.作用：当参数过多时，可以通过容器传递信息

# tuple01 = (1, 2, 3)
# fun01(*tuple01)
#
# dict01 = {"a": 1, "b": 2, "c": 3}
# fun01(*dict01)
#
# set = {1, 2, 4}
# fun01(*set)


# 3.关键字实参：实参根据名称与形参进行对应  keyword argument
# 作用：代码可读性相对较高
# fun01(p2=2, p1=1, p3=3)
# fun01(p2=2, p1=1, p3=3, P4=2)

# 4.字典实参：使用**拆分字典中的键值对，再根据名称与形参对应
# 作用：
dict01 = {"p2": 2, "p1": 1, "p3": 3}
fun01(**dict01)
