"""
    复习
    面向对象
        概述
            面向过程:考虑问题从具体(实现/步骤)出发
            面向对象:考虑问题从对象(谁?干嘛?)出发
        类和对象
            设计角度讲:对象  -抽象化->  类
            编码角度讲:类   -实例化->  对象
            语法:
                class 类名:
                    # 数据
                    def __init__(self,参数):
                        self.数据 = 参数
                    # 行为
                    def 方法名(self):
                        方法体
                变量名 = 类名(参数)
                print(变量名.数据)
                变量名.方法名()
        成员:
            实例成员: 对象.成员
            类成员: 类名.成员


"""
